myinit.el

;; [[file:~/.emacs.d/myinit.org::*Org-Config-Easy-Template][Org-Config-Easy-Template:1]]
;; add <el for emacs-lisp expansion
(add-to-list 'org-structure-template-alist
	     '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"
	       "<src lang=\"emacs-lisp\">\n?\n</src>"))
;; add <p for python expansion
(add-to-list 'org-structure-template-alist
	     '("p" "#+BEGIN_SRC python :results output org drawer\n?\n#+END_SRC"
	       "<src lang=\"python\">\n?\n</src>"))

;; add <r for R expansion
(add-to-list 'org-structure-template-alist
	     '("p" "#+BEGIN_SRC r :results output org drawer\n?\n#+END_SRC"
	       "<src lang=\"r\">\n?\n</src>"))

(add-to-list 'org-structure-template-alist
	     '("ao" "#+attr_org: " ""))

(add-to-list 'org-structure-template-alist
	     '("al" "#+attr_latex: " ""))

(add-to-list 'org-structure-template-alist
	     '("ca" "#+caption: " ""))

(add-to-list 'org-structure-template-alist
	     '("tn" "#+tblname: " ""))

(add-to-list 'org-structure-template-alist
	     '("n" "#+name: " ""))

(add-to-list 'org-structure-template-alist
	     '("o" "#+options: " ""))

(add-to-list 'org-structure-template-alist
	     '("ti" "#+title: " ""))
;; Org-Config-Easy-Template:1 ends here

;; [[file:~/.emacs.d/myinit.org::*FlyCheck][FlyCheck:1]]
(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode t))
;; FlyCheck:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Pyhton][Pyhton:1]]
(use-package jedi
  :ensure t
  :init
  (add-hook 'python-mode-hook 'jedi:setup)
  (add-hook 'python-mode-hook 'jedi:ac-setup))
;; make sure to install jedi-server for effective pip lint
;; M-x jedi:install-server
;; Check Elpy if interested in Python Developement

(use-package elpy
  :ensure t
  :config
  (elpy-enable))

(use-package virtualenvwrapper
  :ensure t
  :config
  (venv-initialize-interactive-shells)
  (venv-initialize-eshell))
;; Pyhton:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Insert-Date_time][Insert-Date_time:1]]
(defun xah-insert-date-time ()
"Insert current date time.
Insert date in this format: yyyy-mm-dd.
When called with `universal-argument', prompt for a format to use.
If there's text selection, delete it first.

URL `http://ergoemacs.org/emacs/elisp_insert-date-time.html'
version 2018-07-03"
  (interactive)
  (let (($style
	 (if current-prefix-arg
	     (string-to-number
	      (substring
	       (ido-completing-read
		"Style:"
		'(
		  "1 → 2018-04-12 Thursday"
		  "2 → 20180412224611"
		  "3 → 2018-04-12T22:46:11-07:00"
		  "4 → 2018-04-12 22:46:11-07:00"
		  "5 → Thursday, April 12, 2018"
		  "6 → Thu, Apr 12, 2018"
		  "7 → April 12, 2018"
		  "8 → Apr 12, 2018"
		  )) 0 1))
	   0
	   )))
    (when (use-region-p) (delete-region (region-beginning) (region-end)))
    (insert
     (cond
      ((= $style 0)
       ;; "2016-10-10"
       (format-time-string "%Y-%m-%d"))
      ((= $style 1)
       ;; "2018-04-12 Thursday"

       (format-time-string "%Y-%m-%d %A"))
      ((= $style 2)
       ;; "20180412224015"
       (replace-regexp-in-string ":" "" (format-time-string "%Y%m%d%T")))
      ((= $style 3)
       (concat
	(format-time-string "%Y-%m-%dT%T")
	(funcall (lambda ($x) (format "%s:%s" (substring $x 0 3) (substring $x 3 5))) (format-time-string "%z")))
       ;; "2018-04-12T22:45:26-07:00"
       )
      ((= $style 4)
       (concat
	(format-time-string "%Y-%m-%d %T")
	(funcall (lambda ($x) (format "%s:%s" (substring $x 0 3) (substring $x 3 5))) (format-time-string "%z")))
       ;; "2018-04-12 22:46:11-07:00"
       )
      ((= $style 5)
       (format-time-string "%A, %B %d, %Y")
       ;; "Thursday, April 12, 2018"
       )
      ((= $style 6)
       (format-time-string "%a, %b %d, %Y")
       ;; "Thu, Apr 12, 2018"
       )
      ((= $style 7)
       (format-time-string "%B %d, %Y")
       ;; "April 12, 2018"
       )
      ((= $style 8)
       (format-time-string "%b %d, %Y")
       ;; "Apr 12, 2018"
       )
      (t
       (format-time-string "%Y-%m-%d"))))))
;; Insert-Date_time:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Paste%20or%20Paste%20Previous][Paste or Paste Previous:1]]
(defun xah-paste-or-paste-previous ()
  "Paste. When called repeatedly, paste previous.
  This command calls `yank', and if repeated, call `yank-pop'."
  ;;
  ;;When `universal-argument' is called first with a number arg, paste that many times.
  ;;
  ;;URL `http://ergoemacs.org/emacs/emacs_paste_or_paste_previous.html'
  ;;Version 2017-07-25"
  (interactive)
  (progn
    (when (and delete-selection-mode (region-active-p))
      (delete-region (region-beginning) (region-end)))
    (if current-prefix-arg
	(progn
	  (dotimes ($i (prefix-numeric-value current-prefix-arg))
	    (yank)))
      (if (eq real-last-command this-command)
	  (yank-pop 1)
	(yank)))))

(global-set-key (kbd "C-y") 'xah-paste-or-paste-previous)
;; Paste or Paste Previous:1 ends here

;; [[file:~/.emacs.d/myinit.org::*White%20Space%20and%20Blank%20Lines][White Space and Blank Lines:1]]
;;In emacs, the following commands lets you delete whitespaces around cursor.
  ;;
  ;;    delete-blank-lines 【Ctrl+x Ctrl+o】
  ;;    just-one-space 【Alt+Space】
  ;;    delete-indentation 【Alt+^】
  ;;    delete-horizontal-space 【Alt+\】
  ;;    fixup-whitespace
  ;;    cycle-spacing (emacs 24.4)
  ;;
  ;;Here's a command xah-shrink-whitespaces that combine most of them into one.

  (defun xah-delete-blank-lines ()
  "Delete all newline around cursor.
  
  URL `http://ergoemacs.org/emacs/emacs_shrink_whitespace.html'
  Version 2018-04-02"
  (interactive)
  (let ($p3 $p4)
    (skip-chars-backward "\n")
    (setq $p3 (point))
    (skip-chars-forward "\n")
    (setq $p4 (point))
    (delete-region $p3 $p4)))

  (defun xah-shrink-whitespaces ()
    "Remove whitespaces around cursor to just one, or none.
    
    Shrink any neighboring space tab newline characters to 1 or none.
    If cursor neighbor has space/tab, toggle between 1 or 0 space.
    If cursor neighbor are newline, shrink them to just 1.
    If already has just 1 whitespace, delete it.
    
    URL `http://ergoemacs.org/emacs/emacs_shrink_whitespace.html'
    Version 2018-04-02T14:38:04-07:00"
    (interactive)
    (let* (
	   ($eol-count 0)
	   ($p0 (point))
	   $p1 ; whitespace begin
	   $p2 ; whitespace end
	   ($charBefore (char-before))
	   ($charAfter (char-after ))
	   ($space-neighbor-p (or (eq $charBefore 32) (eq $charBefore 9) (eq $charAfter 32) (eq $charAfter 9)))
	   $just-1-space-p
)
      (skip-chars-backward " \n\t")
      (setq $p1 (point))
      (goto-char $p0)
      (skip-chars-forward " \n\t")
      (setq $p2 (point))
      (goto-char $p1)
      (while (search-forward "\n" $p2 t )
	(setq $eol-count (1+ $eol-count)))
      (setq $just-1-space-p (eq (- $p2 $p1) 1))
      (goto-char $p0)
      (cond
       ((eq $eol-count 0)
	(if $just-1-space-p
	    (delete-horizontal-space)
	  (progn (delete-horizontal-space)
		 (insert " "))))
       ((eq $eol-count 1)
	(if $space-neighbor-p
	    (delete-horizontal-space)
	  (progn (xah-delete-blank-lines) (insert " "))))
       ((eq $eol-count 2)
	(if $space-neighbor-p
	    (delete-horizontal-space)
	  (progn
	    (xah-delete-blank-lines)
	    (insert "\n"))))
       ((> $eol-count 2)
	(if $space-neighbor-p
	    (delete-horizontal-space)
	  (progn
	    (goto-char $p2)
	    (search-backward "\n" )
	    (delete-region $p1 (point))
	    (insert "\n"))))
       (t (progn
	    (message "nothing done. logic error 40873. shouldn't reach here" ))))))
;; White Space and Blank Lines:1 ends here
