myinit.el

;; [[file:~/.emacs.d/myinit.org::*MarkDown%20mode][MarkDown mode:1]]
(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
	 ("\\.md\\'" . markdown-mode)
	 ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
;; MarkDown mode:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Half-Scrolling%20Similar%20to%20VI][Half-Scrolling Similar to VI:1]]
(defun window-half-height ()
  (max 1 (/ (1- (window-height (selected-window))) 2)))

(defun scroll-up-half ()
  (interactive)
  (scroll-up (window-half-height)))

(defun scroll-down-half ()
  (interactive)
  (scroll-down (window-half-height)))

(global-set-key (kbd "M-u") 'scroll-up-half)
(global-set-key (kbd "C-u") 'scroll-down-half)
;;Scrolling 4 lines without moving the point
(global-set-key (kbd "M-n")  (lambda () (interactive) (scroll-up   4)) )
(global-set-key (kbd "M-p")  (lambda () (interactive) (scroll-down 4)) )
;; Half-Scrolling Similar to VI:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Undo-tree][Undo-tree:1]]
(use-package undo-tree
  :ensure t
  :init
  (global-undo-tree-mode))
;; Undo-tree:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Highlight%20cursor%20line][Highlight cursor line:1]]
(global-hl-line-mode t)
;; Highlight cursor line:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Beacon%20Mode][Beacon Mode:1]]
; flashes the cursor's line when you scroll
  (use-package beacon
    :ensure t
    :config
    (beacon-mode 1)
; this color looks good for the zenburn theme but not for the one
; I'm using for the videos
(setq beacon-color "#666600")
    )
;; Beacon Mode:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Hungy%20Delete%20Mode][Hungy Delete Mode:1]]
; deletes all the whitespace when you hit backspace or delete
  (use-package hungry-delete
    :ensure t
    :config
    (global-hungry-delete-mode))
;; Hungy Delete Mode:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Expand%20Region][Expand Region:1]]
; expand the marked region in semantic increments (negative prefix to reduce region)
    (use-package expand-region
      :ensure t
      :config
      (global-set-key (kbd "C-=") 'er/expand-region))
;; Expand Region:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Multiple%20Cursors][Multiple Cursors:1]]
(use-package multiple-cursors
  :ensure t
  :config
  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))
;; Multiple Cursors:1 ends here

;; [[file:~/.emacs.d/myinit.org::*smart-forward][smart-forward:1]]
(use-package smart-forward
  :ensure t
  :config
  (global-set-key (kbd "M-<up>") 'smart-up)
  (global-set-key (kbd "M-<down>") 'smart-down)
  (global-set-key (kbd "M-<left>") 'smart-backward)
  (global-set-key (kbd "M-<right>") 'smart-forward))
;; smart-forward:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Join%20Line][Join Line:1]]
(global-set-key (kbd "M-j")
		(lambda ()
		  (interactive)
		  (join-line -1)))
;; Join Line:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Rename%20File%20in%20Current%20buffer][Rename File in Current buffer:1]]
(defun rename-current-buffer-file ()
  "Renames current buffer and file it is visiting."
  (interactive)
  (let ((name (buffer-name))
	(filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
	(error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " filename)))
	(if (get-buffer new-name)
	    (error "A buffer named '%s' already exists!" new-name)
	  (rename-file filename new-name 1)
	  (rename-buffer new-name)
	  (set-visited-file-name new-name)
	  (set-buffer-modified-p nil)
	  (message "File '%s' successfully renamed to '%s'"
		   name (file-name-nondirectory new-name)))))))

;;(global-set-key (kbd "C-x C-r") 'rename-current-buffer-file)
;; Rename File in Current buffer:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Move%20Lines%20up%20and%20Down][Move Lines up and Down:1]]
(defun move-line-down ()
  (interactive)
  (let ((col (current-column)))
    (save-excursion
      (forward-line)
      (transpose-lines 1))
    (forward-line)
    (move-to-column col)))

(defun move-line-up ()
  (interactive)
  (let ((col (current-column)))
    (save-excursion
      (forward-line)
      (transpose-lines -1))
    (move-to-column col)))

(global-set-key (kbd "<C-S-down>") 'move-line-down)
(global-set-key (kbd "<C-S-up>") 'move-line-up)
;; Move Lines up and Down:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Highlight%20matching%20pair][Highlight matching pair:1]]
;; Complete pair
;; auto close bracket insertion. New in emacs 24
(electric-pair-mode 1)

;; turn on highlight matching brackets when cursor is on one
(show-paren-mode 1)

;; highlight brackets
(setq show-paren-style 'parenthesis)

;; highlight entire expression
;;(setq show-paren-style 'expression)

;; highlight brackets if visible, else entire expression
;;(setq show-paren-style 'mixed)
;; Highlight matching pair:1 ends here

;; [[file:~/.emacs.d/myinit.org::*string-inflection%20for%20string%20manipulation][string-inflection for string manipulation:1]]
(use-package string-inflection
  :ensure t
  :bind (("C-c i" . string-inflection-all-cycle))
  )

;; for java
(add-hook 'java-mode-hook
	  '(lambda ()
	     (local-set-key (kbd "C-c i") 'string-inflection-java-style-cycle)))

;; for python
(add-hook 'python-mode-hook
	  '(lambda ()
	     (local-set-key (kbd "C-c i") 'string-inflection-python-style-cycle)))
;; string-inflection for string manipulation:1 ends here

;; [[file:~/.emacs.d/myinit.org::*iedit%20and%20narrow%20/%20widen%20dwim][iedit and narrow / widen dwim:1]]
; mark and edit all copies of the marked region simultaniously.

(use-package iedit
  :ensure t)

; if you're windened, narrow to the region, if you're narrowed, widen
; bound to C-x n
(defun narrow-or-widen-dwim (p)
"If the buffer is narrowed, it widens. Otherwise, it narrows intelligently.
Intelligently means: region, org-src-block, org-subtree, or defun,
whichever applies first.
Narrowing to org-src-block actually calls `org-edit-src-code'.

With prefix P, don't widen, just narrow even if buffer is already
narrowed."
  (interactive "P")
  (declare (interactive-only))
  (cond ((and (buffer-narrowed-p) (not p)) (widen))
	((region-active-p)
	 (narrow-to-region (region-beginning) (region-end)))
	((derived-mode-p 'org-mode)
	 ;; `org-edit-src-code' is not a real narrowing command.
	 ;; Remove this first conditional if you don't want it.
	 (cond ((ignore-errors (org-edit-src-code))
		(delete-other-windows))
	       ((org-at-block-p)
		(org-narrow-to-block))
	       (t (org-narrow-to-subtree))))
	(t (narrow-to-defun))))

;; (define-key endless/toggle-map "n" #'narrow-or-widen-dwim)
;; This line actually replaces Emacs' entire narrowing keymap, that's
;; how much I like this command. Only copy it if that's what you want.
(define-key ctl-x-map "n" #'narrow-or-widen-dwim)
;; iedit and narrow / widen dwim:1 ends here

;; [[file:~/.emacs.d/myinit.org::*File-Exists%20Function][File-Exists Function:1]]
(defun load-if-exists(f)
    "load the elip file only if it exits"
    (if (file-readable-p f)
	(load-file f)))
;; You can also use below
;;(when (file-readable-p f) (load-file p))
;; File-Exists Function:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Dump-Keys][Dump-Keys:1]]
(load-if-exists "./custom-el-scripts/dump-keys.el")
;; Dump-Keys:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Web-Mode][Web-Mode:1]]
(use-package web-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
  (setq web-mode-engines-alist
	'(("django"    . "\\.html\\'")))
  (setq web-mode-ac-sources-alist
	'(("css" . (ac-source-css-property))
	  ("html" . (ac-source-words-in-buffer ac-source-abbrev))))

  (setq web-mode-enable-auto-closing t)
  (setq web-mode-enable-auto-quoting t))
;; Web-Mode:1 ends here
